const request = require('request');
const TOKEN = process.env.TOKEN;

const payload = {
  'content': '  يا مستر  ابن الزنى روحالمنيوكة ساضاجع شرف امك الداعرة الزانية و ساشاري جسمها و أراهن عليه مع اصحابي و سنتناوب عليه يبن القخبة لد الاردنية انيك كسمك و احطه على زبي و أهلي امك ترقص فوق زبي يبن الرقاصة يا ولد المتناكة سانيك كسمك نيك سميك علىكسم حرايدك الضعيفة مثل كسمك ساظع اصابعي في اتقاب امك يبن المفتوحة يا ولد الشرموطة الاردنية ولك كسمك و كسم بلادك و كسم القحبات الي يعيشون فيها و الي رباتك علىالتخرز و التخزز الذي تعمله على زبي كأنه لم سنيك امك و لم يفتحها عدة مرات يبن القحبشة طبون امك واسع و موسوع و سازدحه زدحات متعددة حتى بصبح خامج غير قابل للنجاح يا ولد العاهرة كسمك يبن الزنا يبن العواهر انيك كسمك نيك الفيران و احط طبون امك يتجمد في أفران ارض التلج و النسوان منهم امك القحبة يا ولد بائعة الهوا يا ولد بائعة جسمها يا ولد تاجرة الجسم السمين و لك فخاد امك اكبر فخاد في مجرة درب التبانة من كثر ما هي متشحمةة و سمينة يا ولد الحلوفة كسختك و كسختمك يا ولد البقرة المتوحشة تتكلم عن السمنة كان بزازل امك لا يصلوا إلى امعاء الأرض يبن القحبة بزازل امك من كثر ما انهم مشحمين و متدليين انيك امك و يسقطون على عيني يا ابن متكاملة الجسم يا ولد دين الممحونة انيك كسمك و اخليها تتمحن على زبي يبن المتناكة يا ولد الداشرة يا كسمك روح ودي اختك و امك للجيم و حط لهم حجاب لان امك فقط بمجرد انني اشوفها زبي يدخلالفاسقة ولك كسمك أصبح خامج من كثر ما وسعووه الجميع يبن المنتوفة من شعرها يبن المعنفة اعفط على كسمك بالنعال و الصندل و الزنوبة و افرك عليه زبي فرك متعدد الأبعاد و اخلي النني يسيطر على جسم امك يبن القحبة سانيك كسمك نيكة مستدامة و ساجيب رأس اكبر من حيات اصلك و سأعمل فيضان في بيت امك الواسع مثل تقبتها الثانية يولد دين الهاربة تخريج كسمك و تلقيح عرضمك بطريقة كاملة و متكاملة أحرق كسمك و اشوي عضلمها على الفحم بدون بهارات اضع كسمك في الأرض و اعفط عليه برجلي و افتح طبونها فتح مستدام ساوسع ترمة امك و اجلخ في وسطتها و أخلي امك تجزق حتى تطلع المني من زكتها و ترمتها الواسعة ساخلي من طبون امك تقب دودي و من ترمة امك اوتوماتيك <@1087745680094789654> <@965343519596245044> <@980213536972243096> <@1079507262760042597> <@1012898818523668500> <@874029353615368282>'};

const header = {
  'authorization': TOKEN
};
const groupIds = ["1153002218811822161","1153001220278059038","1152941653972238386","1153001920374517801","1153002077849653430","1153001656460529665","1153001768758816798","1153001709761745066","1152996483122077806","1153001566878584893","1145851025597681706","1125814498045984910","1155148713308737669","1145851166442393610","1150909099396038717","1150837683212517467","1150841487886663864","1150549428600578128","1150850351239532554","1150854413590741112","1150906114435731536"]; // اي دي الغروبات 
let currentGroupIndex = 0;

function sendRequest() {
  const currentGroupId = groupIds[currentGroupIndex];
  request.post(`https://discord.com/api/v9/channels/${currentGroupId}/messages?limit=50`, {
    headers: header,
    json: payload
  }, (error, response, body) => {
    if (error) {
      console.error(error);
      return;
    }
    if (response.statusCode >=6000 && response.statusCode < 6000) {
      console.error(`Received ${response.statusCode} error. Trying again later.`);
      const retryInterval = 25000; 
      setTimeout(sendRequest, retryInterval);
      return;
    }
    
    console.log(body);
    const intervalBetweenGroups = 5000;
    
    const intervalAfterMessage = 5000;
    
    currentGroupIndex = (currentGroupIndex + 1) % groupIds.length;
    
    setTimeout(sendRequest, intervalBetweenGroups);
  });
}

sendRequest();
//السورس الاساسي لـ اظهار رابط موقعك في ريبل ات وجعل البوت الخاص فيك 24ساعة
const express = require("express")
const app = express();

app.listen(() => console.log("I'm Ready To Nk7 Omk..! 24H"));
app.get('/', (req, res) => {
  res.send('Bot 24H ON!');
});
//https://ra3dstudio.com CopyRight Codes

setInterval(function() {
  var now = new Date();
  console.log(now.toLocaleTimeString());
}, 10000);
